# two = 0
# for student in range(5):
#     students = input('Кто написал произведение? ')
#     if students == 'Пушкин' or students == 'пушкин':
#         print('правильно, пять!')
#         break
#     print('не провильно, два!')
#     two += 1
# print('Сегодгя', two, 'двойки')

# ///////////////////////////////////////////////////////////////////////////////////////////////////////

# while True:
#     chief = input('Выполнтл вчерашнее задание? ')
#     if chief == 'Да, конечно, сделал':
#         break

# ////////////////////////////////////////////////////////////////////////////////////////////////////////
# user_nane = input('Как тебя зовут? ')
# elephant = input(f'{user_nane},купи слона! ')
# while True:
#     elephant = input(f'Все говорят {elephant} а ты купи слона ')

# //////////////////////////////////////////////////////////////////////////////////////////////////////////

# text = input('Введите текст ')
# for i in text:
#     print(i * 5)

# ///////////////////////////////////////////////////////////////////////////////////////////////////////////

# little = 0
# big = 0
# text = input('Введите текст ')
#
# for i in text:
#     if i == 'Ы':
#         big += 1
#     if i == 'ы':
#         little += 1
#
# print('Маленьких букв Ы:', little)
# print('Больших букв Ы:', big)

# ///////////////////////////////////////////////////////////////////////////////////////////////////////////

# text = "Enumerate в Python"
# for index, symbol in enumerate(text):
#     print("Символ", symbol, "находится на", index, "позиции в тексте")
# # Чтобы считать символы в привычном нам формате,
# # начиная с единицы можно использовать параметр start
# for index, symbol in enumerate(text, start=1):
#     print("Символ", symbol, "находится на", index, "позиции в тексте")

# //////////////////////////////////////////////////////////////////////////////////////////////////////////////

# phrase = input('введите фразу ')
# for symbiol in phrase:
#     print(symbiol, end='\n')

# /////////////////////////////////////////////////////////////////////////////////////////////////////////////////

# print('-' * 10)
# for i in range(1, 10):
#     if i == 1 or i == 9:
#         print('|', end='')
#     else:
#         print('0', end='')
# print()
# for i in range(1, 10):
#     if i == 1 or i == 9:
#         print('|', end='')
#     else:
#         print('0', end='')
# print()
# for i in range(1, 10):
#     if i == 1 or i == 9:
#         print('|', end='')
#     else:
#         print('0', end='')
# print()
# for i in range(1, 10):
#     if i == 1 or i == 9:
#         print('|', end='')
#     else:
#         print('0', end='')
# print()
# print('-' * 10)

# ///////////////////////////////////////////////////////////////////////////////////////////////////////////////
# summ = 0
# progress = int(input('Введите число '))
# step = int(input('Введите шаг '))
#
# print('\nIP-адрес:', end=' ')
# for i in range(3):
#     print(progress, end='.')
#     summ += progress
#     progress += step
#
# print(summ)

# ///////////////////////////////////////////////////////////////////////////////////////////////////////////////

# N = int(input('Введите число: '))
#
# print('-=-', end='')
# if N >= 0:
#     for i in range(N + 1):
#         if i % 10 == 0:
#             print(i, end='-=-')

# //////////////////////////////////////////////////////////////////////////////////////////////////////////////////
