# number = int(input('Введите число: '))
# while number != 0:
#     total = number + number
#     print(total)
#     number = int(input('Введите число: '))
# print("Вы ввели: 0")
import random

# /////////////////////////////////////////////////////////////////////////////////////////////////////////////
# numbers = 7
# total = 0
# while total != 98:
#     total = total + numbers
#     print(total)

# //////////////////////////////////////////////////////////////////////////////////////////////////////////////

# number = 0
# while number < 98:
#     number += 7
#     print(number)

# ///////////////////////////////////////////////////////////////////////////////////////////////////////////

# number = int(input("Введите число: "))
# summ = 0
# while number != 0:
#     last_num = number % 10
#     print(last_num)
#     if last_num == 5:
#         print("Обнаружен разрыв")
#         break
#     summ += last_num
#     number //= 10
# print("Сумма", summ)

# ////////////////////////////////////////////////////////////////////////////////////////////////////////////

# temperature = int(input("Сколько градусов на улице? "))
# dist = 0
# while temperature > 15:
#     dist += 20
#     temperature -= 2
#     if temperature <= 15:
#         break
#     dist += 10
# print("Пройдено", dist, "метров")

# ////////////////////////////////////////////////////////////////////////////////////////////////////////////

# numbers = int(input("введите число: "))
# summ = 0
# number = 0
# while numbers != 0:
#     number = numbers % 10
#     print(number)
#     if number == 5:
#         print("Обнаружен разрыв")
#         break
#     summ += number
#     numbers //= 10
# print("Сумма", summ)

# ////////////////////////////////////////////////////////////////////////////////////////////////////////////
# summ = 0
# numbers = int(input("Ведите числа "))
# while numbers > 0:
#     summ += 1
#     print(summ)
#     numbers = int(input("Ведите следующее число "))
# print("Отрицательное число")

# //////////////////////////////////////////////////////////////////////////////////////////////////////////////

# summ = int(input("Введите стартовую сумму: "))
# while summ < 10000:
#     numbers = int(input("Сколько выпало на кубике? "))
#     if numbers == 3:
#         summ = 0
#         print("Вы все проиграли")
#         break
#     else:
#         summ += 500
#         print("Выиграли 500 рублей")
# print("Игра закончена\nИтого осталось:", summ)

# /////////////////////////////////////////////////////////////////////////////////////////////////////////////


# count = 100
# while count <= 100:
#     if count < 0:
#         print('Время вышло!')
#         break
#     else:
#         print(count)
#         count -= 1

# ///////////////////////////////////////////////////////////////////////////////////////////////////////////////

# while True:
#     work = int(input('Продолжаем работать? 1/0: '))
#     if work == 0:
#         print('Приложение закрывается')
#         break
# print('Работа завершена')
#

# ////////////////////////////////////////////////////////////////////////////////////////////////////////////////
# code_dima = 550
# while True:
#     code = int(input('Компьютер заблокирован. Вернёшь скейт - скажу код разблокировки!\nвведите код:'))
#     if code == code_dima:
#         print('Код верный, завершаю работу')
#         break

# /////////////////////////////////////////////////////////////////////////////////////////////////////////////////

# i = 0
# count = int(input("Введите количество раз "))
# while count != i:
#     i += 1
#     print("Я программист!")
#
# /////////////////////////////////////////////////////////////////////////////////////////////////////////////////
# i = 0
# reminder = int(input("Сколько раз напомнить? "))
# while reminder != i:
#     i += 1
#     print("Вы хотели не забыть о чём-то")

# /////////////////////////////////////////////////////////////////////////////////////////////////////////////////
# mass = 0
# bags = int(input("Сколько мешков? "))
# while bags != 0:
#     weight = int(input("Сколько весит мешок? "))
#     mass += weight
#     bags -= 1
# print(f"Сумарный вес мешков: {mass}")
#
# ////////////////////////////////////////////////////////////////////////////////////////////////////////////////




