# experience = int(input("Введите число очков опыта "))
# if experience <= 0:
#     print("Вы еще не играли")
# elif experience < 1000:
#     print("Ваш уровень: 1")
# elif experience < 2500:
#     print("Ваш уровень: 2")
# elif experience < 5000:
#     print("Ваш уровень: 3")
# else:
#     print("Ваш уровень: 4")

# ///////////////////////////////////////////////////////////////////////////////////////////////////////////

# numbers = int(input("Введите икс: "))
# if numbers < 0:
#     print("Игрек равет", numbers ** 2)
# elif numbers == 0:
#     print("Игрек равен: 5" )
# else:
#     print("Игрек равен", numbers - 12)
#
#


# ////////////////////////////////////////////////////////////////////////////////////////////////////////




# place_list = int(input("Введите место в списке поступающих: "))
# if place_list <= 10:
#     print("Поздравляем, Вы поступили!")
#     mark = int(input("Введите количество баллов за экзамены: "))
#     if mark >= 290:
#         print("Бонусом Вам будет начисляться стипендия")
#     else:
#         print("Но Вам не хватило баллов для стипендии")
# else:
#     print("К сожалению, вы не поступили.")



# //////////////////////////////////////////////////////////////////////////////////////////////////////////

# rating = int(input("Что получил по математике? "))
# if rating == 2 or rating == 3:
#     print("Плохо. Марш учиться!")
# else:
#     print("Молодец! Можешь отдохнуть.")

# //////////////////////////////////////////////////////////////////////////////////////////////////////////

# num = 2
# num2 = 2
# num3 = 2
# if num == num2 == num3:
#     print("3")
# elif (num == num2 != num3) or (num != num2 == num3) or (num == num3 != num2):
#     print("2")
# else:
#     print("0")

# //////////////////////////////////////////////////////////////////////////////////////////////////////////////

# price = int(input("Стоимость квартиры: "))
# space = int(input("Площадь квартиры: "))
# if (price <= 10000000 and space >= 100) or (price <= 7000000 and space >= 80):
#     print("Квартира подходит")
# else:
#     print("Квартира не подходит")

# //////////////////////////////////////////////////////////////////////////////////////////////////////////////////
import random
# 12, 15, 20
# working_hours = random.randint(8, 22)
# lunch = 14 - 15
# unloading = 10, 18
# time = int(input("Введите число от 0 до 23 "))
# if (time >= 22) or (time < 8) or (time >= 14 and time < 15) or (time >= 10 and time < 12) or (time >= 18 and time < 20):
#     print("Посылку получить нельзя")
# else:
#     print("Посылку получить можно")
# #
# ////////////////////////////////////////////////////////////////////////////////////////////////////////////////
# time = int(input("Введите число от 0 до 23 "))
# if (time >= 8 and time < 10) or (time >= 12 and time < 14) or (time >= 15 and time < 18) or (time >= 20 and time < 22):
#     print("Посылку получить можно")
# else:
#     print("Посылку получить нельзя")
