# N = int(input('Введите число: '))
# for i in range(1, N//2 + 1):
#     i *= 2
#     print(i)
#     print(i, '** 3 =', i ** 3)
# //////////////////////////////////////////////////////////////////////////////////////////////////

# N = int(input('Введите число: '))
# for i in range(2, N + 1, 2):
#     print(i, '** 3 =', i ** 3)

# ////////////////////////////////////////////////////////////////////////////////////////////////////

# total_hours = int(input('Введите кол-во часов: '))
# cells = 1
# for hour in range(1, total_hours // 3 + 1):
#     cells *= 2
#     print('прошло часов:', hour * 3)
#     print('кол-во клеток:', cells)
#     print('осталось часов:', total_hours - hour * 3)
#     print()
# print('наблюдение завершено!')

# /////////////////////////////////////////////////////////////////////////////////////////////////////

# numm = int(input('Введите число: '))
# for numbers in range(1, numm + 1, 2):
#     print(numbers ** 3)
#

# ////////////////////////////////////////////////////////////////////////////////////////////////////////

# summ = 0
# N = int(input('Введите кол-во стульев: '))
# for numbers in range(1, N + 1, 5):
#     summ += numbers
#     print('Номер стула:',numbers)
# print('Сумма:',summ)

# /////////////////////////////////////////////////////////////////////////////////////////////////////////////
# water = 0
# calories_total = 0
# morning = int(input('Введите время просыпания: '))
# for food in range(morning, 23, 3):
#     water += 1
#     calories = int(input('Введите сколько калорий съедено: '))
#     calories_total += calories
# print('Выпито воды', water, 'литров воды', 'съедено', calories_total, 'калорий')

# /////////////////////////////////////////////////////////////////////////////////////////////////////////////

# numbers = int(input('Введтите время: '))
# for time in range(numbers, 0, -1):
#     print(time)
# print('Я иду искать!')

# ///////////////////////////////////////////////////////////////////////////////////////////////////////////////

# soldiers_total = int(input('введите кол-во солдат: '))
# order = int(input('Введите кол-во правил в воинском уставе: '))
# push_ups = 0
# for soldiers in range(soldiers_total - 3, 0, -1):
#     if soldiers_total < 4:
#         break
#     order_total = int(input('сколько правил в уставе? '))
#     if order != order_total:
#         print('Отжимайся',soldiers * 10,'раз!')
#         push_ups += soldiers * 10
# print('Всего',push_ups,'отжиманий')

# ///////////////////////////////////////////////////////////////////////////////////////////////////////////////

# n = int(input('Введтите время: '))
# even_n = n - n % 2 # n%2 для чётных чисел будет равно 0, для нечетных будет равно 1, таким образом мы из числа n всегда будем получать четное число
# for time in range(even_n, 0, -2):
#     print(time)
# print('Я иду искать!')