# x = 1
# y = 5
#
# # Введите ваше решение ниже
#
# if x > y:
#     print("X больше Y")
# if x < y:
#      print("X меньше Y")
# if x == y:
#     print("X равен Y")

# /////////////////////////////////////////////////////////////////////////////////////////

# course_price = 75000
# your_wallet = 75000
# if your_wallet >= course_price:
#     your_wallet = your_wallet - course_price
#     if your_wallet < 5000:
#         your_wallet = your_wallet + 1000
#         print("Сделана скидка")
#     print("Курс успешно приобретен!")
# else:
#     print("Не хватает денег на счету")
# print("Остаток на счету:",your_wallet)
# print("Хорошего дня!")

# //////////////////////////////////////////////////////////////////////////////////////////////////////////

# money = 59
# cheese_price = 60
# ice_cream_price = 20
# if money >= cheese_price:
#     print("На сыр денег хватило")
#     money -= cheese_price
#     if money >= ice_cream_price:
#         print("И на мороженное тоже!")
#     else:
#         print("Денег маловато")
# else:
#     print("Денег не хватило даже на сыр!")

# /////////////////////////////////////////////////////////////////////////////////////////////////////////

# x = 6
# y = 6
#
# # Введите ваше решение ниже
#
# if x > y:
#     print("X больше Y")
# elif x < y:
#      print("X меньше Y")
# else:
#     print("X равен Y")

# //////////////////////////////////////////////////////////////////////////////////////////////////////////////

# your_money = 50000
# if your_money <= 0:
#     print("Ошибка: доход не может быть отрицательным")
# elif your_money < 10000:
#     tax = your_money / 100 * 13
#     print("Налог равен: ", tax)
# elif your_money < 50000:
#     tax = your_money / 100 * 20
#     print("Налог равен: ", tax)
# elif your_money >= 50000:
#     tax = your_money / 100 * 30
#     print("Налог равен: ", tax)

# ///////////////////////////////////////////////////////////////////////////////////////////////////////////////////

# first = 2
# second = 1
# third = 2
# if first == second:
#     # min = third
#     print("Третья легче")
# elif first == third:
#     # min = second
#     print("Вторая легче")
# elif second == third:
#     # min = first
#     print("Первая легче")
#
#

# //////////////////////////////////////////////////////////////////////////////////////////////////////////////////
#
# year = 2019
# number_of_speeds = 24
# if year >= 2018 and number_of_speeds >= 24:
#     print("Велосипед подходит")
# else:
#     print("Велосипед не подходит")

# //////////////////////////////////////////////////////////////////////////////////////////////////////////////

# scores = 290
# medal = 1
# if scores > 280 and medal >= 1:
#     print("Поздравляем! Ты поступил!")
# else:
#     print("К сожалению, ты не прошёл в наш университет.")

# ///////////////////////////////////////////////////////////////////////////////////////////////////////////
#
# temperature = 101
# if temperature <= 100 and temperature >= 0:
#     print("Температура в пределах нормы")
# else:
#     print("Опасность!")