# weather = int(input("На улицу идет дождь? "))
# if weather == 1:
#     print("Пошел дождь. Возмите зонтик!")
# else:
#     print("Дождя нет!")

# ///////////////////////////////////////////////////////////////////////////////////////////////

# rus = int(input("Введите количество баллов по русскому языку: "))
# mat = int(input("Введите количество баллов по математике: "))
# inf = int(input("Введите количество баллов по информатике: "))v v  vcddj ;vgb l;
# if rus + mat + inf >= 270:
#     print("Поздравляю, ты поступил на бюджет!")
# else:
#     print("К сожалению, ты не прошел на бюджет.")

# ///////////////////////////////////////////////////////
#
#
# ////////////////////////////////////////////
# num = int(input("Введите какое сейчас число "))
# n = num % 2
# if n == 0:
#     print("Собирайся на работу!")
# else:
#     print("Сегодня восстанавливай силы")
#
#
# ///////////////////////////////////////////////////////////////////////////////////////////////////


# print("*" * 10, "Калькулятор скидки", "*" * 10)
# product_1 = int(input("Введите стоимость первого товара: "))
# product_2 = int(input("Введите стоимость второго товара: "))
# product_3 = int(input("Введите стоимость третьего товара: "))
# summ = product_1 + product_2 + product_3
# if summ <= 10000:
#     print("Сумма товаров равна: ", summ)
# else:
#     print("Сумма товаров равна: ", summ - (summ* 10 / 100))

# ///////////////////////////////////////////////////////////////////////////////////////////////////


# numbers = int(input("Введите число "))
# if numbers < 0:
#
#     print(-numbers)
# else:
#     print(numbers)

# ////////////////////////////////////////////////////////////////////////////////////////////////////


# cube1 = int(input("Введите число с кубика владельца "))
# cube2 = int(input("Введите число с кубика игрока "))
# if cube1 >= cube2:
#     print(cube1 - cube2)
#     print("Игрок платит")
# else:
#     print(cube1 + cube2)
#     print("Владелец платит")
# print("Игра окончена")
#
# ///////////////////////////////////////////////////////////////////////////////////////////////////


# hours = int(input("Введите отработанные часы "))
# loan_balance = int(input("Введите остаток по кредиту "))
# meal = int(input("Введите траты на еду "))
# summ = 200 * hours / 2 ** 3 + hours
# summ2 = loan_balance + meal
# if summ >= summ2:
#     print("Часов хватает. Можно отдохнуть")
# else:
#     print("Часов не хватаетю Придется работать больше!")

# ///////////////////////////////////////////////////////////////////////////////////////////////////////

#
# num1 = int(input("Введите первое число "))
# num2 = int(input("Введите второе число "))
# num3 = int(input("Введите третье число "))
# print(max(num1, num2, num3))

# ////////////////////////////////////////////////////////////////////////////////////////////////////////////



